{
    "Что такое переменная?": "Переменная — это именованная область памяти, которая используется для хранения данных. Значение переменной может изменяться в процессе выполнения программы.",
    "Какие основные типы данных в Python?": "Основные типы данных в Python: int (целое число), float (вещественное число), str (строка), bool (логический тип), list (список), tuple (кортеж), dict (словарь), set (множество).",
    "Что такое цикл for?": "Цикл for используется для перебора последовательности (например, списка, строки или диапазона чисел) и выполнения блока кода для каждого элемента этой последовательности.",
    "Что такое функция в Python?": "Функция — это блок кода, который организован и может быть вызван из других частей программы. Функции объявляются с помощью ключевого слова def.",
    "Как работает оператор if?": "Оператор if проверяет условие: если оно истинно (True), то выполняется соответствующий блок кода. Также могут использоваться elif и else для проверки дополнительных условий.",
    "Что такое список (list)?": "Список — это упорядоченная изменяемая коллекция элементов произвольных типов. Элементы списка можно изменять, добавлять и удалять.",
    "Что такое кортеж (tuple)?": "Кортеж — это неизменяемая упорядоченная коллекция элементов. После создания его содержимое нельзя изменить.",
    "Что такое словарь (dict)?": "Словарь — это неупорядоченная коллекция пар ключ-значение. Ключи должны быть уникальными и неизменяемыми, значения — любого типа.",
    "Что такое модуль в Python?": "Модуль — это файл с расширением .py, содержащий определения функций, классов и переменных, который можно импортировать и использовать в других программах.",
    "Как установить библиотеку в Python?": "Библиотеки в Python устанавливаются с помощью менеджера пакетов pip. Пример команды: pip install имя_библиотеки.",
    "Что такое ООП?": "ООП (объектно-ориентированное программирование) — это парадигма программирования, основанная на понятиях 'класс' и 'объект'. Позволяет создавать структурированный и повторно используемый код.",
    "Что такое Git?": "Git — это система контроля версий, позволяющая отслеживать изменения в файлах кода, работать над проектом нескольким разработчикам одновременно и восстанавливать предыдущие версии проекта.",
    "Что такое виртуальное окружение в Python?": "Виртуальное окружение — это независимая копия интерпретатора Python, в которой можно устанавливать библиотеки без влияния на глобальную среду. Создается с помощью venv или virtualenv.",
    "Как запустить Python-скрипт?": "Для запуска скрипта нужно открыть терминал, перейти в нужную директорию и выполнить: python имя_файла.py",
    "Что такое исключение (exception)?": "Исключение — это событие, возникающее во время выполнения программы и нарушающее её нормальное ход. В Python исключения обрабатываются с помощью try-except.",
    "Что такое рекурсия?": "Рекурсия — это метод решения задачи, при котором функция вызывает саму себя. Используется для упрощения обработки структур данных, таких как деревья и графы.",
    "Что такое алгоритм?": "Алгоритм — это конечная последовательность строго определённых шагов, направленных на решение конкретной задачи. Алгоритмы лежат в основе любой программы.",
    "Что такое IDE?": "IDE (Integrated Development Environment) — это интегрированная среда разработки, предоставляющая удобный интерфейс для написания, тестирования и отладки программного кода (например, PyCharm, VS Code)."
}